# pandas intro

In [1]:
import pandas as pd
import numpy as np

# series list

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# date range

In [3]:
# pd.range the number of period (or days)

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

# Dataframe 2d array

In [5]:
# np.random.randn is standardize normal distribution 
# that has value in range -3 to 3

In [6]:
# (6, 4) is 2d dimension of array

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-06  0.131366 -0.444303 -2.290952  1.067135

# dictionary to dataframe

In [8]:
df2 = pd.DataFrame({
    'A': 1,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3]*4, dtype='int32'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [9]:
df2['E']

0     test
1    train
2     test
3    train
Name: E, dtype: category
Categories (2, object): ['test', 'train']

In [10]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## viewing data

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-05 -0.309411  0.341118  1.457555  0.552161

In [12]:
df.tail()

                   A         B         C         D
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-06  0.131366 -0.444303 -2.290952  1.067135

In [13]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-06  0.131366 -0.444303 -2.290952  1.067135

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

# dataframe to numpy

In [16]:
# dataframe to numpy can be expensive operation as numpy has same data type
# for all values whereas pandas has same data type for a single column

# so if our dataframe has multiple datatypes like (float, int, object)
# then it will take the most expensive one (here the object data type)

In [17]:
df.to_numpy()

array([[-0.60563555,  0.09347916, -0.51626146,  0.33859947],
       [ 0.44167944, -0.5315932 , -1.1832773 , -0.19601969],
       [ 0.07916318, -0.45045383, -0.86776518, -0.12025434],
       [ 1.05882595,  0.57290499,  1.72006755,  1.03286972],
       [-0.30941077,  0.34111754,  1.45755531,  0.55216078],
       [ 0.13136571, -0.44430335, -2.29095245,  1.06713528]])

In [18]:
df2.to_numpy()

array([[1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
# NOTE: column and index are removed when converted to numpy
# DataFrame.to_numpy() does not include the index or column labels in the output

# describe shows summary (mean, std etc)

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.132665 -0.069808 -0.280106  0.445749
std    0.582520  0.470529  1.567195  0.545135
min   -0.605636 -0.531593 -2.290952 -0.196020
25%   -0.212267 -0.448916 -1.104399 -0.005541
50%    0.105264 -0.175412 -0.692013  0.445380
75%    0.364101  0.279208  0.964101  0.912692
max    1.058826  0.572905  1.720068  1.067135

# transpose your data (just like matrix)

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.605636    0.441679    0.079163    1.058826   -0.309411    0.131366
B    0.093479   -0.531593   -0.450454    0.572905    0.341118   -0.444303
C   -0.516261   -1.183277   -0.867765    1.720068    1.457555   -2.290952
D    0.338599   -0.196020   -0.120254    1.032870    0.552161    1.067135

# Sorting methods

In [22]:
df

                   A         B         C         D
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-06  0.131366 -0.444303 -2.290952  1.067135

In [23]:
# Row- wise sorting

In [24]:
df.sort_index(axis = 0, ascending=False)

                   A         B         C         D
2013-01-06  0.131366 -0.444303 -2.290952  1.067135
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-01 -0.605636  0.093479 -0.516261  0.338599

In [25]:
# column-wise sorting

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.338599 -0.516261  0.093479 -0.605636
2013-01-02 -0.196020 -1.183277 -0.531593  0.441679
2013-01-03 -0.120254 -0.867765 -0.450454  0.079163
2013-01-04  1.032870  1.720068  0.572905  1.058826
2013-01-05  0.552161  1.457555  0.341118 -0.309411
2013-01-06  1.067135 -2.290952 -0.444303  0.131366

In [27]:
# sorting by values

In [28]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-06  0.131366 -0.444303 -2.290952  1.067135
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-04  1.058826  0.572905  1.720068  1.032870

# Selection

In [29]:
# .at, .iat, .loc, .iloc

In [30]:
# selecting a single column (which yields a Series, equivalent to df.A)
df['A']

2013-01-01   -0.605636
2013-01-02    0.441679
2013-01-03    0.079163
2013-01-04    1.058826
2013-01-05   -0.309411
2013-01-06    0.131366
Freq: D, Name: A, dtype: float64

In [31]:
# selecting via [rows], which slices the rows (all column included)
df[0:3]

                   A         B         C         D
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254

In [32]:
df['20130101': '20130104']

                   A         B         C         D
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870

In [33]:
# selection by label
df.loc[dates[0]]

A   -0.605636
B    0.093479
C   -0.516261
D    0.338599
Name: 2013-01-01 00:00:00, dtype: float64

In [34]:
df.loc[:, ['A', 'C']]

                   A         C
2013-01-01 -0.605636 -0.516261
2013-01-02  0.441679 -1.183277
2013-01-03  0.079163 -0.867765
2013-01-04  1.058826  1.720068
2013-01-05 -0.309411  1.457555
2013-01-06  0.131366 -2.290952

In [35]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.441679 -0.531593
2013-01-03  0.079163 -0.450454
2013-01-04  1.058826  0.572905

In [36]:
# for getting a scalar value
df.loc[dates[0], 'A']

-0.6056355472910887

In [37]:
# for getting fast access to a scalar (equivalent to the prior method)
df.at[dates[0], 'A']

-0.6056355472910887

In [38]:
# selection by position
df.iloc[3]

A    1.058826
B    0.572905
C    1.720068
D    1.032870
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.058826  0.572905
2013-01-05 -0.309411  0.341118

In [40]:
df.iloc[[1,3,5], [0, 2]]

                   A         C
2013-01-02  0.441679 -1.183277
2013-01-04  1.058826  1.720068
2013-01-06  0.131366 -2.290952

In [41]:
# for getting a value explicitly
df.iloc[1, 1]

-0.5315932018294408

In [42]:
# for getting fast access to a scalar (equivalent to the prior method)
df.iat[1, 1]

-0.5315932018294408

# boolean indexing

In [43]:
df

                   A         B         C         D
2013-01-01 -0.605636  0.093479 -0.516261  0.338599
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-05 -0.309411  0.341118  1.457555  0.552161
2013-01-06  0.131366 -0.444303 -2.290952  1.067135

In [44]:
# using a single column value to select data
df[df['A']> 0]

                   A         B         C         D
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-06  0.131366 -0.444303 -2.290952  1.067135

In [45]:
# selecting values from a DataFrame where a boolean condition is met
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.093479       NaN  0.338599
2013-01-02  0.441679       NaN       NaN       NaN
2013-01-03  0.079163       NaN       NaN       NaN
2013-01-04  1.058826  0.572905  1.720068  1.032870
2013-01-05       NaN  0.341118  1.457555  0.552161
2013-01-06  0.131366       NaN       NaN  1.067135

# isin()

In [46]:
# used to select a certain category in the column
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.605636  0.093479 -0.516261  0.338599    one
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020    one
2013-01-03  0.079163 -0.450454 -0.867765 -0.120254    two
2013-01-04  1.058826  0.572905  1.720068  1.032870  three
2013-01-05 -0.309411  0.341118  1.457555  0.552161   four
2013-01-06  0.131366 -0.444303 -2.290952  1.067135  three

In [48]:
df2['E'].isin(['three'])

2013-01-01    False
2013-01-02    False
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: E, dtype: bool

In [49]:
df2[df2['E'].isin(['three'])]

                   A         B         C         D      E
2013-01-04  1.058826  0.572905  1.720068  1.032870  three
2013-01-06  0.131366 -0.444303 -2.290952  1.067135  three

In [50]:
# multiple categories can be selected
df2[df2['E'].isin(['three', 'one'])]

                   A         B         C         D      E
2013-01-01 -0.605636  0.093479 -0.516261  0.338599    one
2013-01-02  0.441679 -0.531593 -1.183277 -0.196020    one
2013-01-04  1.058826  0.572905  1.720068  1.032870  three
2013-01-06  0.131366 -0.444303 -2.290952  1.067135  three